pmc-request/AuthRequest.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<wsse:Security
		xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
		soapenv:actor=""
		soapenv:mustUnderstand="0">
			<wsse:UsernameToken
			wsu:Id=""
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsse:Username></wsse:Username>
				<wsse:Password
				Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"></wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<authenticateAsAPIClient
		xmlns="http://www.epam.com/wsapi/types">
			<login></login>
			<password></password>
		</authenticateAsAPIClient>
	</soapenv:Body>
</soapenv:Envelope>